<a href="https://colab.research.google.com/github/mizykk/Python-Basic/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas

In [0]:
import pandas as pd

### DataFrame

데이터프레임 생성

pandas.DataFrame(data=None, index=None, columns=None, dtype=None, copy=False)  
[reference](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html#pandas.DataFrame)

In [32]:
student_card = pd.DataFrame({'ID':[20190103, 20190222, 20190531],
                             'name':['Kim', 'Lee', 'Jeong'],
                             'class':['H', 'W', 'S']})
student_card

         ID   name class
0  20190103    Kim     H
1  20190222    Lee     W
2  20190531  Jeong     S

index 지정

In [21]:
student_card = pd.DataFrame({'ID':[20190103, 20190222, 20190531],
                             'name':['Kim', 'Lee', 'Jeong'],
                             'class':['H', 'W', 'S']}, index = ['a', 'b', 'c'])   #index 지정
student_card

         ID   name class
a  20190103    Kim     H
b  20190222    Lee     W
c  20190531  Jeong     S

In [33]:
student_card = pd.DataFrame(([20190103, 'Kim', 'H'],
                             [20190222, 'Lee', 'W'],
                             [20190531, 'Jeong', 'S']), columns = ['ID', 'name', 'class'])   
student_card

         ID   name class
0  20190103    Kim     H
1  20190222    Lee     W
2  20190531  Jeong     S

data type 지정

In [17]:
student_card = pd.DataFrame([[1, 2, 3], [4, 5, 6]], columns = ['a', 'b', 'c'], dtype = float)   #data type 지정
student_card

     a    b    c
0  1.0  2.0  3.0
1  4.0  5.0  6.0

### pd.to_csv()  
csv 파일 내보내기

DataFrame.to_csv(self, path_or_buf=None, sep=', ', na_rep='', float_format=None, columns=None, header=True, index=True, index_label=None, mode='w', encoding=None, compression='infer', quoting=None, quotechar='"', line_terminator=None, chunksize=None, date_format=None, doublequote=True, escapechar=None, decimal='.')  
[reference](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_csv.html)

In [0]:
student_card.to_csv('sc.csv')   #내보낼 데이터프레임.to_csv('파일명.csv')

In [0]:
student_card.to_csv('sc_no_index.csv', index = False)   #index 없이

In [0]:
student_card.to_csv('sc_no_header.csv', header = False)   #header 없이

In [0]:
student_card.to_csv('sc_encoding.csv', encoding = 'UTF-8')   #encoding

### pd.read_csv()  
csv 파일 읽기

In [56]:
pd.read_csv('sc.csv')

         ID   name class
0  20190103    Kim     H
1  20190222    Lee     W
2  20190531  Jeong     S

In [57]:
pd.read_csv('sc.csv', index_col = 'ID')   #Index 지정

           name class
ID
20190103    Kim     H
20190222    Lee     W
20190531  Jeong     S

In [67]:
pd.read_csv('sc.csv', header = 1)   #header 지정

   20190103    Kim  H
0  20190222    Lee  W
1  20190531  Jeong  S

In [71]:
pd.read_csv('sc.csv', names = ['Idx', 'col1', 'col2'], header = 0)   #column명 바꿔서 불러오기

        Idx   col1 col2
0  20190103    Kim    H
1  20190222    Lee    W
2  20190531  Jeong    S

In [78]:
pd.read_csv('sc.csv', skiprows = 2, names = ['ID', 'names', 'class'])   #행 건너띄기

         ID  names class
0  20190222    Lee     W
1  20190531  Jeong     S

In [81]:
pd.read_csv('sc.csv', skipfooter = 1)   #뒤에서 생략할 행의 개수

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support skipfooter; you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

         ID name class
0  20190103  Kim     H
1  20190222  Lee     W

In [79]:
pd.read_csv('sc.csv', nrows = 1)   #몇 개의 행을 불러올지

         ID name class
0  20190103  Kim     H

## pd.to_datetime()  
datetime 형식으로 변환

*to_datetime(arg, errors='raise', dayfirst=False, yearfirst=False, utc=None, box=True, format=None, exact=True, unit=None, infer_datetime_format=False, origin='unix', cache=True)*

In [0]:
df = pd.DataFrame({'year': [2015, 2016],
                   'month': [2, 3],
                   'day': [4, 5]})
df

   year  month  day
0  2015      2    4
1  2016      3    5

In [0]:
pd.to_datetime(df)

0   2015-02-04
1   2016-03-05
dtype: datetime64[ns]

In [0]:
pd.to_datetime('2017.05.31', format = ('%Y.%m.%d')).date

[reference](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.to_datetime.html)

## pd.get_dummies()  
One-Hot Encoding

*pandas.get_dummies(data, prefix=None, prefix_sep='_', dummy_na=False, columns=None, sparse=False, drop_first=False, dtype=None)*

In [0]:
import numpy as np   #NaN 생성
import pandas as pd

fruit = pd.DataFrame({'name':['apple', 'banana', 'cherry', 'durian', np.nan],
                      'color':['red', 'yellow', 'red', 'green', np.nan]})   #예시 데이터 생성
fruit

In [0]:
pd.get_dummies(fruit)   #dataframe 전체를 했을 때

In [0]:
pd.get_dummies(fruit, columns=['name'])   #dataframe에서 특정 열만 인코딩

In [0]:
pd.get_dummies(fruit['name'], drop_first=True)   #N-1개 생성

In [0]:
pd.get_dummies(fruit['name'], dummy_na = True)   #결측값도 인코딩

[참고](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.get_dummies.html)